'''1.Проверка условий
Напишите программу,
которая принимает на вход логические значения двух переменных
(свет включён и окно открыто)
и проверяет:
Оба ли условия выполнены.
Хотя бы одно из условий выполнено.
Пример вывода:
Свет включён? (1 для True, 0 для False): 1
Окно открыто? (1 для True, 0 для False): 0
Оба условия выполнены? False
Хотя бы одно условие выполнено? True'''



'''2. Стоимость мобильного тарифа
Напишите программу для расчёта стоимости использования мобильного тарифа:
Базовая стоимость: 30 евро.
Каждый мегабайт интернета сверх 500 МБ стоит 0.2 евро.
Программа должна запросить у пользователя количество использованных мегабайтов 
и вывести сколько всего он заплатил (базовый и переплата).
Пример вывода:
Введите использованные мегабайты: 510
Общая стоимость: 32.0'''



