""" 4.3. Покупка книги
Добавьте в меню клиента возможность купить книгу из списка доступных.
Пользователь видит список всех книг в наличии;
Затем вводит номер книги и количество;
Если книги недостаточно — вывести сообщение Not enough books in stock.;
Если денег недостаточно — вывести сообщение Insufficient funds.;
Если всё успешно — списывается количество книг и сумма с баланса пользователя;
После успешной покупки — вывести сообщение Purchase successful.
Пример ввода:
Enter book number: 1
Enter quantity: 2
Пример вывода:
Purchase successful.
"""

def purchase_book(connection, user_id, db_name):
    pass

"""Добавьте как пункт 3 в user_menu:"""

