""" 01 Проверка на подмножество

Напишите программу, которая
- проверяет, содержит ли первое множество все элементы второго множества.

Реализуйте решение несколькими способами.
(в том числе и способом, НЕ используящим возможности множеств).

Данные:
set1 = {1, 2, 3, 4}
set2 = {2, 3}
Пример вывода:
True
"""

 # 1 способ issubset
#
# set1 = {1, 2, 3, 4}
# set2 = {2, 3}
#
# print(set2.issubset(set1))

# 2 способ <=
# set1 = {1, 2, 3, 4}
# set2 = {2, 3}
#
# print(set2 <= set1)

# 3 способ for (НЕ используящим возможности множеств)
set1 = {1, 2, 3, 4}
set2 = {2, 3}

result = True

for item in set2:
    if item not in set1:
        result = False

print(result)
