""" 13 Зашифрованное послание

Есть строка с зашифрованным посланием.
Всё, что было приложено к этой строке - это небольшой набор слов:
"ave caesar-dyh#fdhvdu"

Кажется нам было отправлено сообщение по шифру Цезаря.
Его принцип - сдвиг каждой буквы вправо по алфавиту на одинаковое количество символов.
Нужно расшифровать послание и вывести найденный сдвиг и послание на экран.

Данные:
message = "92 114 120 35 102 100 113 35 103 114 35 108 119 36 35 92 114 120 35 100 117 104 35 106 117 104 100 119 35 100 113 103 35 76 35 101 104 111 108 104 121 104 35 108 113 35 124 114 120 36"

Пример вывода:
Сдвиг: 3
Послание: You can do it! You are great and I believe in you!
"""

message = "92 114 120 35 102 100 113 35 103 114 35 108 119 36 35 92 114 120 35 100 117 104 35 106 117 104 100 119 35 100 113 103 35 76 35 101 104 111 108 104 121 104 35 108 113 35 124 114 120 36"
hint = "ave-dyh"