"""
Задача: форматированный вывод таблицы товаров

Дана строка с информацией о товарах:

data = "яблоки 120 5, бананы 80 8, груши 150 3, апельсины 200 6, киви 90 4, манго 300 2, сливы 110 7"

Требуется:

1. Преобразовать строку в список товаров.
2. Для каждого товара вычислить общую стоимость: (цена * количество)
3. Вывести таблицу в следующем формате:
"""
from itertools import product

"""
+--------------+--------+--------+----------+
| Наименование |  Цена  | Кол-во |   Сумма  |
+--------------+--------+--------+----------+
| Яблоки       | 120.00 |   5    |   600.00 |
| Бананы       |  80.00 |   8    |   640.00 |
| Груши        | 150.00 |   3    |   450.00 |
| Апельсины    | 200.00 |   6    |  1200.00 |
| Киви         |  90.00 |   4    |   360.00 |
| Манго        | 300.00 |   2    |   600.00 |
| Сливы        | 110.00 |   7    |   770.00 |
+--------------+--------+--------+----------+
|             ИТОГО:             |  4620.00 |
+--------------------------------+----------+
"""

# data = "яблоки 120 5, бананы 80 8, груши 150 3, апельсины 200 6, киви 90 4, манго 300 2, сливы 110 7"
#
# data = "яблоки 120 5, бананы 80 8, груши 150 3, апельсины 200 6, киви 90 4, манго 300 2, сливы 110 7"
#
# items = data.split(", ")
#
# products =[]
#
# total_sum = 0
#
# for item in items:
#     parts = item.split()
#     name = parts[0]
#     price = float(parts[1])
#     quantity = int(parts[2])
#     total = price * quantity
#
#     total_sum += total
#
#     products.append((name, price, quantity, total))
#
# print("+--------------+--------+--------+----------+")
# print("| Наименование |  Цена  | Кол-во |   Сумма  |")
# print("+--------------+--------+--------+----------+")
#
# for name, price, quantity, total in products:
#     print(f" | {name:<12} | {price:>6.2f} | {quantity:6} | {total:>8.2f}")
#
# print("+--------------+--------+--------+----------+")
# print(f" | {'ИТОГО:':<30} | {total_sum:>8.2f} |")
# print("+--------------+--------+--------+----------+")


data = "яблоки 120 5, бананы 80 8, груши 150 3, апельсины 200 6, киви 90 4, манго 300 2, сливы 110 7"

goods = data.split(", ")

header = """
+--------------+--------+--------+----------+
| Наименование | Цена | Кол-во | Сумма |
+--------------+--------+--------+----------+
"""

footer = """+--------------+--------+--------+----------+
| ИТОГО: | {total:8.2f} |
+--------------------------------+----------+
"""
print(header, end="")

total = 0
for good in goods:
    name, price, count = good.split(" ")
    price = float(price)
    count = int(count)
    total_price = price * count
    total += total_price
    print(f"| {name:12} | {price:6.2f} | {count:6} | {total_price:8.2f} |")

print(footer.format(total=total))